<a href="https://colab.research.google.com/github/mal-cul1830/vincent-chase/blob/master/taxdata.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [311]:
import pandas as pd
df = pd.read_csv('mixedData.csv',header = None, engine = 'python')

In [312]:
import re
import numpy

In [313]:
df.head()

     0                                                  1
0  NaN  slno;invoiceamt;regno;vehicleclass;taxAmt;TxnD...
1  0.0  403694;0;AP22AB9055MOTOR CYCLE;3630;1/4/2019;R...
2  1.0  423772;0;AP22AJ5656MOTOR CYCLE;3950;2/4/2019;R...
3  2.0  671362;0;AP22AB0387Vehicle Fitted with Constru...
4  3.0  434759;0;AP22M4984MOTOR CYCLE;3720;1/4/2019;RT...

In [314]:
print(df.iloc[1,1])

403694;0;AP22AB9055MOTOR CYCLE;3630;1/4/2019;RTA MAHABOOBNAGAR

In [315]:
cols = str(df.iloc[0,1])
cols = list(map(str,cols.split(';')))

In [316]:
for i in range(len(cols)):
  if i not in range(len(df.columns)):
    print('hello')
    df[str(cols[i])] = pd.Series()

hello
hello
hello
hello
hello

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:4: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  after removing the cwd from sys.path.

In [317]:
df.columns = cols

In [318]:
for index,rows in df.iterrows():
  if index ==0:
    continue
  df.loc[index] = [index]+list(re.split('[;,]',str(list(rows)[1])))
  df.loc[index,'regno'],df.loc[index,'vehicleclass']= str(df.loc[index,'vehicleclass'])[0:10],str(df.loc[index,'vehicleclass'])[10:]
df.drop(index=0,inplace = True)
df.set_index('slno',inplace = True)
df.head()

     invoiceamt       regno  ...   TxnDate             Office
slno                         ...
1.0      403694  AP22AB9055  ...  1/4/2019  RTA MAHABOOBNAGAR
2.0      423772  AP22AJ5656  ...  2/4/2019  RTA MAHABOOBNAGAR
3.0      671362  AP22AB0387  ...  2/4/2019  RTA MAHABOOBNAGAR
4.0      434759  AP22M4984M  ...  1/4/2019  RTA MAHABOOBNAGAR
5.0      683249  AP22AG9578  ...  2/4/2019  RTA MAHABOOBNAGAR

[5 rows x 6 columns]

In [319]:
conv_dict = {
    'invoiceamt' : int,
'regno':str,
'vehicleclass':str,
'taxAmt':float,
'TxnDate':str,
'Office':str
}
df = df.astype(conv_dict)
df.dtypes

invoiceamt        int64
regno            object
vehicleclass     object
taxAmt          float64
TxnDate          object
Office           object
dtype: object

In [320]:
df.head()

      invoiceamt       regno  ...   TxnDate             Office
slno                          ...
1.0       403694  AP22AB9055  ...  1/4/2019  RTA MAHABOOBNAGAR
2.0       423772  AP22AJ5656  ...  2/4/2019  RTA MAHABOOBNAGAR
3.0       671362  AP22AB0387  ...  2/4/2019  RTA MAHABOOBNAGAR
4.0       434759  AP22M4984M  ...  1/4/2019  RTA MAHABOOBNAGAR
5.0       683249  AP22AG9578  ...  2/4/2019  RTA MAHABOOBNAGAR

[5 rows x 6 columns]

In [321]:
df_tax = pd.DataFrame()
df_tax['Office'] = df['Office'].unique()

In [322]:
percentage = []
date = []
for i in df_tax['Office']:
  tax = df[df.Office == str(i)].taxAmt.sum()
  invoice = df[df.Office == str(i)].invoiceamt.sum()
  percentage.append(tax/invoice*100)
  m = df[df.Office == str(i)].taxAmt.max()
  date.append(df.loc[df.query("Office == '"+str(i)+"' and taxAmt == "+str(m)).index[0],'TxnDate'])
df_tax['Percentage'] = percentage
df_tax['MaxTaxDate'] = date
df_tax.set_index('Office',inplace = True)

In [323]:
df_tax.head(10)

                    Percentage MaxTaxDate
Office
RTA MAHABOOBNAGAR     0.288823   1/4/2019
RTA ADILABAD          0.324501   2/4/2019
RTA MEDCHAL           0.505130   2/4/2019
RTA NALGONDA          0.336192   2/4/2019
RTA RANGAREDDY        0.810503   1/4/2019
RTA KARIMNAGAR        0.351421   1/4/2019
RTA-HYDERABAD-EZ      0.662462   1/4/2019
RTA NIRMAL            0.572758   1/4/2019
RTA WARANGAL URBAN    0.544201   2/4/2019
RTA JAGITYAL          0.505486   2/4/2019